
&НаКлиенте
Процедура Цифра(Команда) 
	Если НовоеЧисло тогда
		ТекущееЗначение = "";
		НовоеЧисло = Ложь;
	КонецЕсли;           
	
	Ц = СтрЗаменить(Команда.имя, "Цифра", "");
	
	Если Ц = "00" Тогда 
		Если НЕ ЗначениеЗаполнено(ТекущееЗначение) Тогда 
			Ц = "0";
		КонецЕсли;	
	КонецЕсли;	    
	
	Если Ц = "00" ИЛИ Ц = "0" Тогда 
		Если ТекущееЗначение = "0" Тогда 
			Ц = "";
		КонецЕсли;
	КонецЕсли;	
	
	ТекущееЗначение = ТекущееЗначение + Ц;
КонецПроцедуры


&НаКлиенте
Процедура Точка(Команда)
	Если (СтрНайти(ТекущееЗначение,",") = 0) тогда
		ТекущееЗначение = ТекущееЗначение + ",";
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Операция(Команда)
	ПредыдущееЗначение = ТекущееЗначение;
	Если Команда.имя = "Сложить" тогда
		Операция = "+";
	ИначеЕсли Команда.имя = "Вычесть" тогда
		Операция = "-";
	ИначеЕсли Команда.имя = "Умножить" тогда
		Операция = "*";
	ИначеЕсли Команда.имя = "Разделить" тогда
		Операция = "/";
	КонецЕсли;
	НовоеЧисло = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Равно(Команда)
	если Операция = "+" тогда
		ТекущееЗначение = Число(ПредыдущееЗначение) + Число(ТекущееЗначение);
	ИначеЕсли Операция = "-" тогда
		ТекущееЗначение = Число(ПредыдущееЗначение) - Число(ТекущееЗначение);
	ИначеЕсли Операция = "*" тогда
		ТекущееЗначение = Число(ПредыдущееЗначение) * Число(ТекущееЗначение);
	ИначеЕсли Операция = "/" тогда                                          
		ТекЧисло = Число(ТекущееЗначение);
		Если ТекЧисло <> 0 Тогда
			ТекущееЗначение = Число(ПредыдущееЗначение) / ТекЧисло;
		Иначе
			ТекущееЗначение = "Деление на 0!";
		КонецЕсли;
	КонецЕсли;
	НовоеЧисло = Истина;

КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	ТекущееЗначение = "";
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьВычисление(Команда)
	ТекущееЗначение = "";
	ПредыдущееЗначение = "";                 
	Операция = "";
КонецПроцедуры


&НаКлиенте
Процедура УдалитьПоследнийСимвол(Команда)
	ДлинаЗначения = СтрДлина(ТекущееЗначение);
	ТекущееЗначение = Лев(ТекущееЗначение,ДлинаЗначения - 1);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ПредыдущееЗначение = ТекущееЗначение;

	Если Команда.Имя = "Сложить" тогда
		Операция = "+";
	ИначеЕсли Команда.Имя = "Вычесть" тогда
		Операция = "-";
	ИначеЕсли Команда.Имя = "Умножить" тогда
		Операция = "*";
	ИначеЕсли Команда.Имя = "Разделить" тогда
		Операция = "/";
	КонецЕсли;                        
	
	НовоеЧисло = Истина;
КонецПроцедуры




